УРВ_файловая/src/Catalogs/Ошибки/Ошибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ошибки</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <comment>Номер ошибки во внешней системе учета ошибок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Воспроизведение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПуть</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКарточка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Витрина</name>
      <type>
        <types>CatalogRef.Витрины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <comment>Разделы базы знаний</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Ошибки/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    БазаЗнаний.ФормаВыбораПриСозданииНаСервере(ЭтотОбъект);
    
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ТипКарточек = Настройки.Получить("ТипКарточек");
	Если ТипКарточек <> Неопределено Тогда
		Настройки.Удалить("ТипКарточек");
	КонецЕсли;
	
	КоличествоДнейОтбораОбращений = Настройки.Получить("КоличествоДнейОтбораОбращений");
	Если КоличествоДнейОтбораОбращений <> Неопределено Тогда
		Настройки.Удалить("КоличествоДнейОтбораОбращений");
	КонецЕсли;
	
	ОтображатьЗакрытые = Настройки.Получить("ОтображатьЗакрытые");
	Если ОтображатьЗакрытые <> Неопределено Тогда
		Настройки.Удалить("ОтображатьЗакрытые");
	КонецЕсли;
	
    БазаЗнаний.УстановитьОтборыСписков(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Основание  = Новый Структура;
	Основание.Вставить("Сервис", Сервис);
	Основание.Вставить("Витрина", Витрина);
	Основание.Вставить("Компоненты", КомпонентСписок.ВыгрузитьЗначения());
	Основание.Вставить("Разделы", РазделСписок.ВыгрузитьЗначения());
	Основание.Вставить("Обращение", Обращение);
	
	ПараметрыФормы = Новый Структура("Основание", Основание);
	
	ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", ПараметрыФормы, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПриИзменении(Элемент)
    
    СервисПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СервисОчистка(Элемент, СтандартнаяОбработка)
    
    СервисПриИзмененииНаСервере();
    
КонецПроцедуры

&НаКлиенте
Процедура ВитринаПриИзменении(Элемент)
    
    ВитринаПриИзмененииНаСервере();
    
КонецПроцедуры

&НаКлиенте
Процедура ВитринаОчистка(Элемент, СтандартнаяОбработка)
    
    ВитринаПриИзмененииНаСервере();
    
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеПодбора = КомпонентСписок.ВыгрузитьЗначения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеПодбора", ДанныеПодбора);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Сервис));
	
	Оповещение = Новый ОписаниеОповещения("КомпонентСписокНачалоВыбораЗавершение", ЭтотОбъект);
	 
	ОткрытьФорму("Справочник.КомпонентыСервиса.Форма.ФормаПодбора", ПараметрыФормы, Элементы.КомпонентСписок, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокПриИзменении(Элемент)
	
	УстановитьОтборыСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеПодбора = РазделСписок.ВыгрузитьЗначения();
	
	Оповещение = Новый ОписаниеОповещения("РазделСписокНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ДанныеПодбора", ДанныеПодбора);
	 
	ОткрытьФорму("Справочник.Разделы.Форма.ФормаПодбора", ПараметрыФормы, Элементы.РазделСписок, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокПриИзменении(Элемент)
	
	УстановитьОтборыСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура Топ10Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
    ОповеститьОВыборе(Элементы.Топ10.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНастроитьНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ГиперссылкаНастроитьНажатиеЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоличествоДнейОтбораОбращений", КоличествоДнейОтбораОбращений);
	ПараметрыФормы.Вставить("ИспользоватьОтображатьЗакрытые", Истина);
	ПараметрыФормы.Вставить("ОтображатьЗакрытые", ОтображатьЗакрытые);
	ПараметрыФормы.Вставить("ТипКарточек", "Ошибки");
	 
	ОткрытьФорму("ОбщаяФорма.УстановкаНастроекДляТоп10",ПараметрыФормы,ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьИсправленныеПриИзменении(Элемент)
	
    ОтображатьИсправленныеПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ГиперссылкаНастроитьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
        ГиперссылкаНастроитьНажатиеЗавершениеНаСервере(Результат);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСписков()
	
    БазаЗнаний.УстановитьОтборыСписков(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокНачалоВыбораЗавершение(Результат, ПараметрыДляВыбора) Экспорт
	
	Если Результат <> Неопределено Тогда
		РазделСписок.ЗагрузитьЗначения(Результат);
		УстановитьОтборыСписков();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокНачалоВыбораЗавершение(Результат, ПараметрыДляВыбора) Экспорт
	
	Если Результат <> Неопределено Тогда
		КомпонентСписок.ЗагрузитьЗначения(Результат);
		УстановитьОтборыСписков();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СервисПриИзмененииНаСервере()
    
    Если БазаЗнанийПовтИсп.СервисВитрины(Витрина) <> Сервис Тогда
        Витрина = БазаЗнанийПовтИсп.ОсновнаяВитринаСервиса(Сервис);
    КонецЕсли;
    
    БазаЗнаний.УстановитьПараметрыВыбораВладельца(Элементы.КомпонентСписок, Сервис);
	УстановитьОтборыСписков();
	
КонецПроцедуры

&НаСервере
Процедура ВитринаПриИзмененииНаСервере()
	
    Если Сервис <> БазаЗнанийПовтИсп.СервисВитрины(Витрина) Тогда
        Сервис = БазаЗнанийПовтИсп.СервисВитрины(Витрина);
    КонецЕсли;
    
    БазаЗнаний.УстановитьПараметрыВыбораВладельца(Элементы.КомпонентСписок, Сервис);
	УстановитьОтборыСписков();
	
КонецПроцедуры

&НаСервере
Процедура ГиперссылкаНастроитьНажатиеЗавершениеНаСервере(Результат)
    
    КоличествоДнейОтбораОбращений = Результат.КоличествоДнейОтбораОбращений;
    ОтображатьЗакрытые = Результат.ОтображатьЗакрытые;
    БазаЗнаний.ЗаполнитьТоп10(ЭтотОбъект);
    
КонецПроцедуры

&НаСервере
Процедура ОтображатьИсправленныеПриИзмененииНаСервере()
	
    УстановитьОтборыСписков();
	
КонецПроцедуры

#КонецОбласти
